import java.lang.reflect.Array;
import java.util.*;

//public class Seminar_6 {

//    static void task0() {
// 1. Создайте HashSet, заполните его следующими числами: {1, 2, 3, 2, 4, 5, 6, 3}.
// Распечатайте содержимое данного множества.
//
// 2. Создайте LinkedHashSet, заполните его следующими числами: {1, 2, 3, 2, 4, 5, 6, 3}.
// Распечатайте содержимое данного множества.
//
// 3. Создайте TreeSet, заполните его следующими числами: {1, 2, 3, 2, 4, 5, 6, 3}.
// Распечатайте содержимое данного множества.
//
//        Integer[] arr = {1, 2, 3, 4};
//        String[] arr2 = {"sdsd","sdsd","dssdsd","sdsd"}
//        Set<Integer> set1 -new HashSet<>(Arrays.asList(arr));
//        Set<Integer> set2 -new LinkedHashSet<>(Arrays.asList(arr));
//        Set<Integer> set3 -new TreeSet<>(Arrays.asList(arr));
//        System.out.println(arr1);
//
//
//    }
//}
